#include <iostream>
#include <cstdlib>
#include <string>
#include "function.h"
using namespace std;
int main()
{
	cout << "================================================================================\n" << endl;
	cout << "================================================================================\n" << endl;
	cout << "*************************欢迎使用学生成绩管理系统*********************************\n" << endl;
	cout << "--------------------------------------------------------------------制作人:振华马\n" << endl;
	cout << "********************************************************************************\n" << endl;
	cout << "================================================================================\n" << endl;
	cout << "请按任意键进入学生操作管理系统：" << endl;
	getchar();
	system("cls");
	cout << "===================================================================================\n" << endl;
	cout << "===================================请选择要操作的命令：==============================\n" << endl;
	cout << "==================================1.输入学生信息===================================\n" << endl;
	cout << "===================================2.输出学生信息===================================\n" << endl;
	cout << "===================================3.删除学生信息===================================\n" << endl;
	cout << "===================================4.查找学生信息===================================\n" << endl;
	cout << "===================================5.修改学生信息===================================\n" << endl;
	cout << "===================================6.将学生的语文成绩按从大到小排====================\n" << endl;
	cout << "===================================7.将学生的数学成绩按从大到小排====================\n" << endl;
	cout << "===================================8.将学生的英语成绩按从大到小排====================\n" << endl;
	cout << "===================================9.将学生的总成绩按从大到小排=====================\n" << endl;
	int item;
	student st;
	while (1)
	{
		cout << "请选择操作命令：";
		cin >> item;
		system("cls");
		switch (item)
		{
		case 1:
		{
			st.inputstudent();
		}
		break;
		case 2:
		{
			st.outputstudent();
		}
		break;
		case 3:
		{
			st.deletestudent();
		}
		break;
		case 4:
		{
			st.searchstudent();
		}
		break;
		case 5:
		{
			st.changestudent();
		}
		break;
		case 6:
		{
			st.scortbychinese();
		}
		break;
		case 7:
		{
			st.scortbymath();
		}
		break;
		case 8:
		{
			st.scortbyenglish();
		}
		break;
		case 9:
		{
			st.scortbytotal();
		}
		break;
		default: break;
		}
	}
	return 0;
}
